tap 'homebrew/cask'
tap 'homebrew/cask-drivers'

# Development Tools
brew 'git'
brew 'cmake'

# Editors
brew 'emacs'

# Security
cask 'keepassx'
cask 'yubico-authenticator'

# Applications
cask 'firefox'
cask 'slack'

# Nucli dependencies
brew 'bash'
brew 'coreutils'
brew 'binutils'
brew 'diffutils'
brew 'ed'
brew 'findutils'
brew 'gawk'
brew 'gnu-indent'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-which'
brew 'gnutls'
brew 'grep'
brew 'gzip'
brew 'screen'
brew 'watch'
brew 'wget'
brew 'wdiff'
brew 'awscli'
brew 'jq'
brew 'node'
brew 'fzf'